{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Все вхождения подстроки в строку \n",
    "Напишите программу, которая находит все вхождения подстроки в строку. Строка и подстрока вводятся с клавиатуры.\n",
    "\n",
    "<details>\n",
    "<summary>Ответ</summary>\n",
    "<code>\n",
    "s: str = input(\"Введите строку: \")\n",
    "substring: str = input(\"Введите подстроку: \")\n",
    "\n",
    "positions: list = []\n",
    "pos = s.find(substring)\n",
    "while pos != -1:\n",
    "    positions.append(pos)\n",
    "    pos = s.find(substring, pos + 1)\n",
    "\n",
    "print(positions)\n",
    "</code>\n",
    "</details>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Найти два максимума в массиве"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Напишите программу, которая находит и выводит на экран два максимума в массиве целых чисел. Без сортировки массива.\n",
    "\n",
    "<details>\n",
    "<summary>Ответ</summary>\n",
    "<code>\n",
    "numbers: list[int] = [12, 2, 5, 7, 1]\n",
    "max1: int = numbers[0]\n",
    "max2: int = numbers[1]\n",
    "for number in numbers:\n",
    "    if number > max1:\n",
    "        max2 = max1\n",
    "        max1 = number\n",
    "    elif number > max2 and number < max1:\n",
    "        max2 = number\n",
    "print(max1, max2)\n",
    "</code>\n",
    "</details>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Найти два минимума в массиве"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Напишите программу, которая находит и выводит на экран два максимума в массиве целых чисел. Без сортировки массива.\n",
    "\n",
    "<details>\n",
    "<summary>Ответ</summary>\n",
    "<code>\n",
    "numbers: list[int] = [1, 2, 5, 7, 12]\n",
    "min1: int = numbers[0]\n",
    "min2: int = numbers[1]\n",
    "for number in numbers:\n",
    "    if min1 > number:\n",
    "        min2 = min1\n",
    "        min1 = number\n",
    "    elif number > min2 and number < min1:\n",
    "        min2 = number\n",
    "print(min1, min2)\n",
    "</code>\n",
    "</details>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задача Иосифа Флавия"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "n человек, пронумерованных числами от 11 до n, стоят в кругу. Они начинают считаться, каждый k-й по счету человек выбывает из круга, после чего счет продолжается со следующего за ним человека. Напишите программу, определяющую номер человека, который останется в кругу последним.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подаются два натуральных числа n и k, каждое на отдельной строке.\n",
    "\n",
    "Формат выходных данных\n",
    "Программа должна вывести одно число – номер человека, который останется в кругу последним.\n",
    "\n",
    "Примечание 1. Подробнее ознакомиться с классической задачей Иосифа Флавия можно по [ссылке](https://ru.wikipedia.org/wiki/%D0%97%D0%B0%D0%B4%D0%B0%D1%87%D0%B0_%D0%98%D0%BE%D1%81%D0%B8%D1%84%D0%B0_%D0%A4%D0%BB%D0%B0%D0%B2%D0%B8%D1%8F).\n",
    "\n",
    "Примечание 2. Визуализацию работы алгоритма можно посмотреть по [ссылке](https://www.geogebra.org/m/ExvvrBbR).\n",
    "\n",
    "|Входные данные |\tВыходные данные |\n",
    "|---------------|-------------------|\n",
    "|    2 1        |         2         |\n",
    "|    5 2        |         3         |\n",
    "|    7 5        |         6         |\n",
    "|   50 25       |         5         |\n",
    "|   77 28       |         50        |\n",
    "|  100 99       |         88        |"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Зодиак"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Китайский гороскоп назначает животным годы в 12-летнем цикле. Один 12-летний цикл показан в таблице ниже. Таким образом, 2012 год будет очередным годом дракона.\n",
    "\n",
    "|Год|Животное|\n",
    "|---|--------|\n",
    "|2000|Дракон|\n",
    "|2001|Змея|\n",
    "|2002|Лошадь|\n",
    "|2003|Овца|\n",
    "|2004|Обезьяна|\n",
    "|2005|Петух|\n",
    "|2006|Собака|\n",
    "|2007|Свинья|\n",
    "|2008|Крыса|\n",
    "|2009|Бык|\n",
    "|2010|Тигр|\n",
    "|2011|Заяц|\n",
    "\n",
    "Напишите программу, которая считывает год и отображает название связанного с ним животного. Ваша программа должна корректно работать с любым годом, не только теми, что перечислены в таблице.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается натуральное число – год.\n",
    "\n",
    "Формат выходных данных\n",
    "Программа должна вывести текст – название животного.\n",
    "\n",
    "|Входные данные|Выходные данные|\n",
    "|--------------|---------------|\n",
    "|2020|Крыса|\n",
    "|1945|Петух|\n",
    "|2000|Дракон|\n",
    "\n",
    "\n",
    "<details>\n",
    "<summary>Ответ</summary>\n",
    "<code>\n",
    "animals: list[str] = [\"Обезьяна\", \"Петух\", \"Собака\", \"Свинья\", \"Крыса\", \"Бык\", \"Тигр\", \"Заяц\", \"Дракон\", \"Змея\", \"Лошадь\", \"Овца\"]\n",
    "\n",
    "year: int = int(input())\n",
    "print(animals[year%12])\n",
    "</code>\n",
    "</details>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Standard American Convention"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "На вход программе подается натуральное число. Напишите программу, которая вставляет в заданное число запятые в соответствии со стандартным американским соглашением о запятых в больших числах.\n",
    "\n",
    "Формат входных данных\n",
    "На вход программе подается натуральное число $n$ $(0 < n < 10^{100})$.\n",
    "\n",
    "Формат выходных данных\n",
    "Программа должна вывести число с запятыми в соответствии с условием задачи.\n",
    "\n",
    "|Входные данные|Выходные данные|\n",
    "|--------------|---------------|\n",
    "|1000000|1,000,000|\n",
    "|100|100|\n",
    "|12345|12,345|\n",
    "\n",
    "<details>\n",
    "<summary>Ответ</summary>\n",
    "<code>\n",
    "n = int(input())\n",
    "\n",
    "print(f\"{n:,}\")\n",
    "</code>\n",
    "</details>"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
